#+TITLE: Advent of Code 2024

Since this year is the year of APL, we are going to use a jupyter notebook!

#+begin_src dyalog
'Hello World'
#+end_src

#+begin_src jupyter-apl :session *new*
⍳6
#+end_src

#+RESULTS:
: 1 2 3 4 5 6
: 

* Day 1
#+begin_src jupyter-apl :session *2024-day1*
INPUT←1 0 0 1/⎕CSV⍠'Separator' ' '⊢'inputs/1.txt'⍬4
INPUT
#+end_src

** Part 1

#+begin_src jupyter-apl :session *2024-day1*
+/|-⌿({⍵[⍋⍵]}⍤1)⍉INPUT
#+end_src

#+RESULTS:
: 2970687
: 
** Part 2
#+begin_src jupyter-apl :session *2024-day1*
RIGHT←(⍉INPUT)[2;]
LEFT←(⍉INPUT)[1;]

+/×/{⍺,¯1+≢⍵}⌸LEFT,RIGHT
#+end_src

#+RESULTS:
: 23963899
:

* TODO Day 2
#+begin_src jupyter-apl :session *2024-day2*
INPUT←⍎¨⊃⎕NGET'inputs/2.txt'1
#+end_src

** Part 1
#+begin_src jupyter-apl :session *2024-day2*
DIFF←(1↓¨INPUT)-(¯1↓¨INPUT)
(((+/¨DIFF>0)∧(+/¨DIFF<0))=0)
(+/¨DIFF>0)
(+/¨DIFF<0)
#+end_src

* Day 3
#+begin_src jupyter-apl :session *2024-day3*
INPUT←⊃⎕NGET'inputs/3.txt'1
#+end_src

** Part 1
#+begin_src jupyter-apl :session *2024-day3*
MUL←('\d+' ⎕S {⍎(⍵.Match)})¨('mul\(\d+,\d+\)' ⎕S '\0') INPUT
+/×/¨MUL
#+end_src

#+RESULTS:
: 184576302
: 

** Part 2
#+begin_src jupyter-apl :session *2024-day3*
MUL← ('don''t\(\).*' ⎕R 'X') ('don''t\(\).*do\(\)' ⎕R 'X' ⍠ 'Greedy' 0) INPUT
MUL←('\d+' ⎕S {⍎(⍵.Match)})¨('mul\(\d+,\d+\)' ⎕S '\0') MUL
+/×/¨MUL
#+end_src

#+RESULTS:
: 119285584
: 
